```
╭─ ~/projects/platform  95/ensia96/2026-01-08                                                                                                                                               목 23:03  mango 
╰ ❯ source .env
╭─ ~/projects/platform  95/ensia96/2026-01-08                                                                                                                                               목 23:03  mango 
╰ ❯ terraform apply -target=oci_core_subnet.internal -target=oci_containerengine_node_pool.main
data.oci_identity_availability_domains.main: Reading...
data.oci_containerengine_cluster_option.main: Reading...
data.oci_core_services.all_services: Reading...
oci_identity_compartment.main: Refreshing state... [id=ocid1.compartment.oc1..aaaaaaaaxks7l2gcjjk3euzod7mzd22vc6bmczuqtto3f6z3aamcglgy2ujq]
data.oci_identity_availability_domains.main: Read complete after 0s [id=IdentityAvailabilityDomainsDataSource-686890930]
data.oci_identity_fault_domains.main: Reading...
oci_core_vcn.main: Refreshing state... [id=ocid1.vcn.oc1.ap-seoul-1.amaaaaaabsyhd7qazvdwifpfgn75iw5yxheajr5ng4esmlikj23v7ee2ef3q]
data.oci_containerengine_cluster_option.main: Read complete after 0s [id=ContainerengineClusterOptionDataSource-1870923232]
data.oci_core_services.all_services: Read complete after 0s [id=CoreServicesDataSource-0]
oci_core_network_security_group.cluster: Refreshing state... [id=ocid1.networksecuritygroup.oc1.ap-seoul-1.aaaaaaaargvnkigajohw6qvznbzlrdtmivyeaunrlx5dgeqvugie7xywtnea]
oci_core_network_security_group.worker: Refreshing state... [id=ocid1.networksecuritygroup.oc1.ap-seoul-1.aaaaaaaaz5y4ozx4tv6f6r3vbymfmwgddettc25rc5w2afrg5libo3o662fq]
oci_core_nat_gateway.main: Refreshing state... [id=ocid1.natgateway.oc1.ap-seoul-1.aaaaaaaap7fljb33jz7xfhnm54leup5owryl6xen4fzgkvnjqdz3dtsoupkq]
oci_core_service_gateway.main: Refreshing state... [id=ocid1.servicegateway.oc1.ap-seoul-1.aaaaaaaa6pdgo7kccqt4r4cs747knrxybmaz2xkcvdaqau6ztjc2rdm3tnba]
data.oci_identity_fault_domains.main: Read complete after 0s [id=IdentityFaultDomainsDataSource-2954258040]
oci_core_route_table.private: Refreshing state... [id=ocid1.routetable.oc1.ap-seoul-1.aaaaaaaa2gdnpvg6ecx744a63vowlzaagbsqkmbb7wuf2i5lyyilfaesfpmq]
oci_core_subnet.private: Refreshing state... [id=ocid1.subnet.oc1.ap-seoul-1.aaaaaaaaz2zzw7w2kolrxzxelyfpu2lnsa6oths6txnblyewgc7wf3pr6dqq]
oci_core_subnet.internal: Refreshing state... [id=ocid1.subnet.oc1.ap-seoul-1.aaaaaaaaeifgzovm4h5gbljdd2zhdpwiqlxx3b47gs3ij6ltkvzc53xefxfa]
oci_containerengine_cluster.main: Refreshing state... [id=ocid1.cluster.oc1.ap-seoul-1.aaaaaaaafpb7pnnc2bx2nteaelcmccukzna2ssytpqytlzpqrcxcq3bracoq]
data.oci_containerengine_node_pool_option.main: Reading...
data.oci_containerengine_node_pool_option.main: Read complete after 0s [id=ContainerengineNodePoolOptionDataSource-3381421671]
oci_containerengine_node_pool.main: Refreshing state... [id=ocid1.nodepool.oc1.ap-seoul-1.aaaaaaaanphdkn6kbd5e6ptijingeokewwstwgsprud34ovfinghw55iyhlq]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the last "terraform apply" which may have affected this plan:

  # oci_core_subnet.internal has been deleted
  - resource "oci_core_subnet" "internal" {
      - id                         = "ocid1.subnet.oc1.ap-seoul-1.aaaaaaaaeifgzovm4h5gbljdd2zhdpwiqlxx3b47gs3ij6ltkvzc53xefxfa" -> null
        # (19 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the relevant attributes using ignore_changes, the following plan may include actions to undo or respond to these changes.

───────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # oci_containerengine_node_pool.main will be created
  + resource "oci_containerengine_node_pool" "main" {
      + cluster_id          = "ocid1.cluster.oc1.ap-seoul-1.aaaaaaaafpb7pnnc2bx2nteaelcmccukzna2ssytpqytlzpqrcxcq3bracoq"
      + compartment_id      = "ocid1.compartment.oc1..aaaaaaaaxks7l2gcjjk3euzod7mzd22vc6bmczuqtto3f6z3aamcglgy2ujq"
      + defined_tags        = (known after apply)
      + freeform_tags       = (known after apply)
      + id                  = (known after apply)
      + kubernetes_version  = "v1.34.1"
      + lifecycle_details   = (known after apply)
      + name                = "platform-node-pool-main"
      + node_image_id       = (known after apply)
      + node_image_name     = (known after apply)
      + node_metadata       = (known after apply)
      + node_shape          = "VM.Standard.A1.Flex"
      + node_source         = (known after apply)
      + nodes               = (known after apply)
      + quantity_per_subnet = (known after apply)
      + ssh_public_key      = (known after apply)
      + state               = (known after apply)
      + subnet_ids          = (known after apply)

      + initial_node_labels (known after apply)

      + node_config_details {
          + defined_tags                        = (known after apply)
          + freeform_tags                       = (known after apply)
          + is_pv_encryption_in_transit_enabled = (known after apply)
          + kms_key_id                          = (known after apply)
          + nsg_ids                             = [
              + "ocid1.networksecuritygroup.oc1.ap-seoul-1.aaaaaaaaz5y4ozx4tv6f6r3vbymfmwgddettc25rc5w2afrg5libo3o662fq",
            ]
          + size                                = 2

          + node_pool_pod_network_option_details {
              + cni_type          = "OCI_VCN_IP_NATIVE"
              + max_pods_per_node = 31
              + pod_nsg_ids       = [
                  + "ocid1.networksecuritygroup.oc1.ap-seoul-1.aaaaaaaaz5y4ozx4tv6f6r3vbymfmwgddettc25rc5w2afrg5libo3o662fq",
                ]
              + pod_subnet_ids    = (known after apply)
            }

          + placement_configs {
              + availability_domain     = "rtRb:AP-SEOUL-1-AD-1"
              + capacity_reservation_id = (known after apply)
              + fault_domains           = [
                  + "FAULT-DOMAIN-1",
                  + "FAULT-DOMAIN-2",
                  + "FAULT-DOMAIN-3",
                ]
              + subnet_id               = "ocid1.subnet.oc1.ap-seoul-1.aaaaaaaaz2zzw7w2kolrxzxelyfpu2lnsa6oths6txnblyewgc7wf3pr6dqq"

              + preemptible_node_config (known after apply)
            }
        }

      + node_eviction_node_pool_settings (known after apply)

      + node_pool_cycling_details (known after apply)

      + node_shape_config {
          + memory_in_gbs = 12
          + ocpus         = 2
        }

      + node_source_details {
          + boot_volume_size_in_gbs = (known after apply)
          + image_id                = "ocid1.image.oc1.ap-seoul-1.aaaaaaaabnw26mt4gt6ix5vl5mwx5qvec2ys76qix5frgvypqcdfk6n3yzwa"
          + source_type             = "IMAGE"
        }
    }

  # oci_core_subnet.internal will be created
  + resource "oci_core_subnet" "internal" {
      + availability_domain        = (known after apply)
      + cidr_block                 = "10.0.64.0/18"
      + compartment_id             = "ocid1.compartment.oc1..aaaaaaaaxks7l2gcjjk3euzod7mzd22vc6bmczuqtto3f6z3aamcglgy2ujq"
      + defined_tags               = (known after apply)
      + dhcp_options_id            = (known after apply)
      + display_name               = "platform-subnet-internal"
      + dns_label                  = "internal"
      + freeform_tags              = (known after apply)
      + id                         = (known after apply)
      + ipv4cidr_blocks            = (known after apply)
      + ipv6cidr_block             = (known after apply)
      + ipv6cidr_blocks            = (known after apply)
      + ipv6virtual_router_ip      = (known after apply)
      + prohibit_internet_ingress  = (known after apply)
      + prohibit_public_ip_on_vnic = true
      + route_table_id             = "ocid1.routetable.oc1.ap-seoul-1.aaaaaaaa2gdnpvg6ecx744a63vowlzaagbsqkmbb7wuf2i5lyyilfaesfpmq"
      + security_list_ids          = (known after apply)
      + state                      = (known after apply)
      + subnet_domain_name         = (known after apply)
      + time_created               = (known after apply)
      + vcn_id                     = "ocid1.vcn.oc1.ap-seoul-1.amaaaaaabsyhd7qazvdwifpfgn75iw5yxheajr5ng4esmlikj23v7ee2ef3q"
      + virtual_router_ip          = (known after apply)
      + virtual_router_mac         = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.
╷
│ Warning: Resource targeting is in effect
│ 
│ You are creating a plan with the -target option, which means that the result of this plan may not represent all of the changes requested by the current configuration.
│ 
│ The -target option is not for routine use, and is provided only for exceptional situations such as recovering from errors or mistakes, or when Terraform specifically suggests to use it as part of an error
│ message.
╵

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

oci_core_subnet.internal: Creating...
oci_core_subnet.internal: Creation complete after 3s [id=ocid1.subnet.oc1.ap-seoul-1.aaaaaaaa24kgzg3tohrigtryvgvd6cgp45x2hw7anab24nqdlhej42furp7q]
oci_containerengine_node_pool.main: Creating...
oci_containerengine_node_pool.main: Still creating... [00m10s elapsed]
oci_containerengine_node_pool.main: Still creating... [00m20s elapsed]
oci_containerengine_node_pool.main: Still creating... [00m30s elapsed]
oci_containerengine_node_pool.main: Still creating... [00m40s elapsed]
oci_containerengine_node_pool.main: Still creating... [00m50s elapsed]
oci_containerengine_node_pool.main: Still creating... [01m00s elapsed]
oci_containerengine_node_pool.main: Still creating... [01m10s elapsed]
oci_containerengine_node_pool.main: Still creating... [01m20s elapsed]
oci_containerengine_node_pool.main: Still creating... [01m30s elapsed]
oci_containerengine_node_pool.main: Still creating... [01m40s elapsed]
oci_containerengine_node_pool.main: Still creating... [01m50s elapsed]
oci_containerengine_node_pool.main: Still creating... [02m00s elapsed]
oci_containerengine_node_pool.main: Creation complete after 2m8s [id=ocid1.nodepool.oc1.ap-seoul-1.aaaaaaaawrgitfasfz6juh4e4rfjwinmkmui65zbotrvo7lavnswp3jlq5eq]
╷
│ Warning: Applied changes may be incomplete
│ 
│ The plan was created with the -target option in effect, so some changes requested in the configuration may have been ignored and the output values may not be fully updated. Run the following command to
│ verify that no other changes are pending:
│     terraform plan
│ 
│ Note that the -target option is not suitable for routine use, and is provided only for exceptional situations such as recovering from errors or mistakes, or when Terraform specifically suggests to use it
│ as part of an error message.
╵

Apply complete! Resources: 2 added, 0 changed, 0 destroyed.
```